#include <stdio.h>
#include <math.h>

int main() {
    float x0 = 1.0, x1 = 3.0;
    float a0 = 2.0, a1 = 4.0;
    float hx = 1.3, ha = 1.3;

    for (float x = x0; x <= x1; x += hx) {
        for (float a = a0; a <= a1; a += ha) {

            float o1 = -999999.0;    //берём очень большое отрицательное число для проверки, чтобы программа не выдала ошибку и случайное число не стало по ошибке максимальным
            if (x != 0 && (a - x) / x >= 0) {  //проверка, что делитель не равен 0 и подкоренное выражение неотрицательно
                o1 = sqrt((a - x) / x);
            }

            float o2 = -999999.0;
            if (x != 0) {   //проверка, что делитель не равен 0
                o2 = cos((a * a) / x);
            }

            float o3 = -999999.0;
            if (a >= 0) { //проверяем, что число под корнем неотрицательно
                float r = (x*x*x * sqrt(a)) / (a + 2.5);
                if (fabs(sin(r)) > 1e-6) { //проверка, что sin не равен 0 (1e-6 = 10**-6, проверяет что синус не слишком близок к 0)
                    o3 = cos(r) / sin(r);
                }
            }
            float z = o1; //ищем максимальное значение
            if (o2 > z) {
                z = o2;
            }
            if (o3 > z) {
                z = o3;
            }

            if (z == -999999.0) {
                 printf("x = %f; a = %f; z = ошибка\n", x, a);
            } else {
                 printf("x = %f; a = %f; z = %f\n", x, a, z);
            }
}
    }
return 0;
}

